{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adam",
      "learning_rate": "0.0002",
      "decay": 0.0,
      "beta_1": "0.9",
      "beta_2": "0.999",
      "epsilon": 3e-05,
      "amsgrad": false,
      "str_float": [
         "learning_rate",
         "beta_1",
         "beta_2"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 64,
      "learning_rate": 0.0002,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2559.308245897293,
      "history": {
         "loss": [
            1.8475604057312012,
            0.5114681124687195,
            0.2850911319255829,
            0.18782316148281097,
            0.13561785221099854,
            0.10466401278972626,
            0.08394166827201843,
            0.0660143494606018,
            0.05877899006009102,
            0.05160455033183098,
            0.04626725986599922,
            0.04261123389005661,
            0.0355917327105999,
            0.03810522332787514,
            0.033999670296907425,
            0.02682693488895893,
            0.0286739319562912,
            0.028014468029141426,
            0.02628861553966999,
            0.026254823431372643,
            0.026970816776156425,
            0.022330302745103836,
            0.02523607201874256,
            0.01890694350004196,
            0.020983507856726646,
            0.022330056875944138,
            0.020228860899806023,
            0.018692130222916603,
            0.02089502289891243,
            0.019608234986662865
         ],
         "accuracy": [
            0.46100544929504395,
            0.8365622758865356,
            0.9070565104484558,
            0.9389804005622864,
            0.9551191329956055,
            0.9657604694366455,
            0.9727780818939209,
            0.9783108234405518,
            0.9810506701469421,
            0.9836491346359253,
            0.9850632548332214,
            0.9864420294761658,
            0.9886693358421326,
            0.9884041547775269,
            0.9896768927574158,
            0.9916566610336304,
            0.9909495711326599,
            0.9917804002761841,
            0.9919925332069397,
            0.9923283457756042,
            0.9920101761817932,
            0.9935657382011414,
            0.9925051331520081,
            0.9942197799682617,
            0.9937071204185486,
            0.9933359026908875,
            0.9945732951164246,
            0.9944318532943726,
            0.994361162185669,
            0.9945732951164246
         ],
         "val_loss": [
            0.6702154874801636,
            0.3760114014148712,
            0.21227683126926422,
            0.16411204636096954,
            0.15341851115226746,
            0.2555530071258545,
            0.12243560701608658,
            0.1081087663769722,
            0.10676339268684387,
            0.10477834194898605,
            0.10276743769645691,
            0.1378249228000641,
            0.09600537270307541,
            0.1054842621088028,
            0.1586041897535324,
            0.14275908470153809,
            0.14738567173480988,
            0.1116420105099678,
            0.132552370429039,
            0.15893812477588654,
            0.1290711760520935,
            0.10574392229318619,
            0.1181408017873764,
            0.14173273742198944,
            0.12688280642032623,
            0.14252084493637085,
            0.16980913281440735,
            0.15058672428131104,
            0.14343421161174774,
            0.12565159797668457
         ],
         "val_accuracy": [
            0.7916572093963623,
            0.8787844181060791,
            0.9311973452568054,
            0.9477577805519104,
            0.9508877992630005,
            0.9204985499382019,
            0.9618711471557617,
            0.9664807915687561,
            0.9677896499633789,
            0.9676758646965027,
            0.9698953032493591,
            0.9619849920272827,
            0.9735374450683594,
            0.9722285270690918,
            0.9583427906036377,
            0.9669929146766663,
            0.963350772857666,
            0.9734236001968384,
            0.9705781936645508,
            0.9617573618888855,
            0.9720008969306946,
            0.972456157207489,
            0.97257000207901,
            0.9679604172706604,
            0.9720008969306946,
            0.9718301892280579,
            0.9601638913154602,
            0.9672206044197083,
            0.9675620198249817,
            0.974846363067627
         ]
      }
   }
}