{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adam",
      "learning_rate": "0.0002",
      "decay": 0.0,
      "beta_1": "0.9",
      "beta_2": "0.999",
      "epsilon": 1e-07,
      "amsgrad": false,
      "str_float": [
         "learning_rate",
         "beta_1",
         "beta_2"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 128,
      "learning_rate": 0.0002,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2525.76478266716,
      "history": {
         "loss": [
            1.7284082174301147,
            0.542213499546051,
            0.3037799298763275,
            0.2044111043214798,
            0.1438961774110794,
            0.10519297420978546,
            0.08986159414052963,
            0.0739666074514389,
            0.05930519476532936,
            0.05362487956881523,
            0.047840483486652374,
            0.04344206303358078,
            0.03846962749958038,
            0.03873754292726517,
            0.0341108962893486,
            0.032738130539655685,
            0.031374551355838776,
            0.026824643835425377,
            0.029571371152997017,
            0.02687443420290947,
            0.023643886670470238,
            0.023850809782743454,
            0.0259078536182642,
            0.02205224148929119,
            0.023761631920933723,
            0.024999357759952545,
            0.02057553268969059,
            0.021806204691529274,
            0.018742762506008148,
            0.019829507917165756
         ],
         "accuracy": [
            0.49133846163749695,
            0.8266280293464661,
            0.9025136232376099,
            0.9336420893669128,
            0.952467679977417,
            0.9658665060997009,
            0.9713285565376282,
            0.9759067893028259,
            0.9799901247024536,
            0.9828360080718994,
            0.9845153093338013,
            0.9861062169075012,
            0.9879799485206604,
            0.9876440763473511,
            0.9898536205291748,
            0.9900657534599304,
            0.9903839230537415,
            0.9916743040084839,
            0.9912854433059692,
            0.9922930002212524,
            0.9932121634483337,
            0.9928056001663208,
            0.9926819205284119,
            0.993371307849884,
            0.99308842420578,
            0.9932829141616821,
            0.9941667318344116,
            0.9941136837005615,
            0.9941136837005615,
            0.994272768497467
         ],
         "val_loss": [
            0.6483626961708069,
            0.33408063650131226,
            0.22182348370552063,
            0.15941105782985687,
            0.1419132798910141,
            0.21194033324718475,
            0.1304248571395874,
            0.16068218648433685,
            0.13055311143398285,
            0.13899531960487366,
            0.13365744054317474,
            0.11231043934822083,
            0.13372854888439178,
            0.13236171007156372,
            0.10722007602453232,
            0.10977364331483841,
            0.11554072797298431,
            0.1398838609457016,
            0.13517077267169952,
            0.14679484069347382,
            0.11742135882377625,
            0.1292003095149994,
            0.1315620094537735,
            0.1295214593410492,
            0.13255518674850464,
            0.1577596664428711,
            0.10388943552970886,
            0.20336472988128662,
            0.11780034005641937,
            0.12054893374443054
         ],
         "val_accuracy": [
            0.7967789769172668,
            0.8891417980194092,
            0.9275552034378052,
            0.9476439952850342,
            0.9547006487846375,
            0.9374573230743408,
            0.9576029777526855,
            0.9533917307853699,
            0.9607899188995361,
            0.9602208137512207,
            0.9625540375709534,
            0.9677896499633789,
            0.9636922478675842,
            0.9663100242614746,
            0.9728545546531677,
            0.9725130796432495,
            0.9701798558235168,
            0.9669929146766663,
            0.9684156775474548,
            0.9660823941230774,
            0.9725130796432495,
            0.9702936410903931,
            0.9713749289512634,
            0.9722285270690918,
            0.9713749289512634,
            0.9627248048782349,
            0.9764397740364075,
            0.9554404616355896,
            0.974334180355072,
            0.9750170707702637
         ]
      }
   }
}