{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "SGD",
      "learning_rate": "0.125",
      "decay": 0.0,
      "momentum": "0.1",
      "nesterov": false,
      "str_float": [
         "learning_rate",
         "momentum"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 16,
      "learning_rate": 0.125,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2956.7991473674774,
      "history": {
         "loss": [
            3.6384475231170654,
            3.6377482414245605,
            3.637639284133911,
            3.6375677585601807,
            3.6376070976257324,
            3.6375749111175537,
            3.63757586479187,
            3.6376020908355713,
            3.6376073360443115,
            3.637585163116455,
            3.6375932693481445,
            3.63761830329895,
            3.63757061958313,
            3.637601137161255,
            3.637566089630127,
            3.6376075744628906,
            3.63755202293396,
            3.6375811100006104,
            3.637577772140503,
            3.6375718116760254,
            3.637585163116455,
            3.637577533721924,
            3.637572765350342,
            3.637584924697876,
            3.6376078128814697,
            3.637586832046509,
            3.6375670433044434,
            3.637576103210449,
            3.637561082839966,
            3.6375932693481445
         ],
         "accuracy": [
            0.03217139095067978,
            0.03296683728694916,
            0.03312592953443527,
            0.033249665051698685,
            0.033338047564029694,
            0.033355724066495895,
            0.03312592953443527,
            0.03332037106156349,
            0.033338047564029694,
            0.0333734005689621,
            0.033338047564029694,
            0.033161282539367676,
            0.03319663554430008,
            0.03321431204676628,
            0.0334264300763607,
            0.03323198854923248,
            0.03309057652950287,
            0.033143606036901474,
            0.033267341554164886,
            0.03330269455909729,
            0.03323198854923248,
            0.03330269455909729,
            0.033338047564029694,
            0.03317895904183388,
            0.033161282539367676,
            0.03321431204676628,
            0.03330269455909729,
            0.03310825303196907,
            0.033143606036901474,
            0.03321431204676628
         ],
         "val_loss": [
            3.6375296115875244,
            3.6373143196105957,
            3.637310028076172,
            3.6373817920684814,
            3.6373300552368164,
            3.637373447418213,
            3.6373114585876465,
            3.6373403072357178,
            3.637317419052124,
            3.6373112201690674,
            3.63732647895813,
            3.6373209953308105,
            3.63734769821167,
            3.6373300552368164,
            3.637350082397461,
            3.637341260910034,
            3.6373138427734375,
            3.6373379230499268,
            3.6373467445373535,
            3.6373534202575684,
            3.6373367309570312,
            3.637373208999634,
            3.6373212337493896,
            3.6373088359832764,
            3.637326717376709,
            3.637345314025879,
            3.637350082397461,
            3.637341260910034,
            3.6373283863067627,
            3.6373231410980225
         ],
         "val_accuracy": [
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832
         ]
      }
   }
}