{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "SGD",
      "learning_rate": "0.125",
      "decay": 0.0,
      "momentum": "0.115",
      "nesterov": false,
      "str_float": [
         "learning_rate",
         "momentum"
      ]
   },
   "params": {
      "ep": 15,
      "batch_size": 32,
      "learning_rate": 0.125,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 1274.9236416816711,
      "history": {
         "loss": [
            3.6355881690979004,
            3.634416341781616,
            2.5180091857910156,
            1.1854661703109741,
            0.6715373396873474,
            0.4272325336933136,
            0.3137646019458771,
            0.2539461553096771,
            0.22066280245780945,
            0.19378405809402466,
            0.16237200796604156,
            0.15962502360343933,
            0.1455526500940323,
            0.15089379251003265,
            0.16595672070980072
         ],
         "accuracy": [
            0.03190624341368675,
            0.033656224608421326,
            0.2712826132774353,
            0.6291628479957581,
            0.7886586785316467,
            0.8669660091400146,
            0.9019833207130432,
            0.9236371517181396,
            0.9330764412879944,
            0.9430637359619141,
            0.9531393647193909,
            0.9540055394172668,
            0.9586191177368164,
            0.9573817253112793,
            0.9554019570350647
         ],
         "val_loss": [
            3.571140766143799,
            3.629706382751465,
            1.5030022859573364,
            0.7519938349723816,
            0.3960726857185364,
            0.3430536091327667,
            0.34467729926109314,
            0.30010664463043213,
            0.3072737157344818,
            0.21011142432689667,
            0.25056201219558716,
            0.21943113207817078,
            0.30399560928344727,
            0.2905772030353546,
            0.3172934651374817
         ],
         "val_accuracy": [
            0.0253243800252676,
            0.0506487600505352,
            0.5307307243347168,
            0.7611541152000427,
            0.8722399473190308,
            0.8944343328475952,
            0.8945481181144714,
            0.9156612753868103,
            0.9104256629943848,
            0.9390507340431213,
            0.9333598613739014,
            0.9391076564788818,
            0.9153767228126526,
            0.923287034034729,
            0.9231732487678528
         ]
      }
   }
}