{
   "name": "base2m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_41_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_41",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_18",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_42",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_19",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_43",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_20",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_44",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_21",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_45",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "GlobalMaxPooling2D",
         "config": {
            "name": "global_max_pooling2d",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last",
            "keepdims": false
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_13",
            "trainable": true,
            "dtype": "float32",
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_8",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_14",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adam",
      "learning_rate": "1e-04",
      "decay": 0.0,
      "beta_1": "0.9",
      "beta_2": "0.999",
      "epsilon": 1e-07,
      "amsgrad": false,
      "str_float": [
         "learning_rate",
         "beta_1",
         "beta_2"
      ]
   },
   "params": {
      "ep": 15,
      "batch_size": 32,
      "learning_rate": 0.0001,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 1263.1164712905884,
      "history": {
         "loss": [
            2.099832534790039,
            0.9759637117385864,
            0.6532955169677734,
            0.478971928358078,
            0.36855313181877136,
            0.2933724522590637,
            0.2371467649936676,
            0.19488511979579926,
            0.16586247086524963,
            0.13751234114170074,
            0.11614639312028885,
            0.09995904564857483,
            0.0877729132771492,
            0.07831335812807083,
            0.06958425045013428
         ],
         "accuracy": [
            0.39733436703681946,
            0.6987202167510986,
            0.7950399518013,
            0.8487237691879272,
            0.8796401023864746,
            0.9041045308113098,
            0.9224881529808044,
            0.9351092576980591,
            0.94437175989151,
            0.9531393647193909,
            0.9601569771766663,
            0.9658665060997009,
            0.9705154299736023,
            0.9733967185020447,
            0.9761366248130798
         ],
         "val_loss": [
            0.9969733953475952,
            0.6270803213119507,
            0.44333964586257935,
            0.3442777991294861,
            0.28527045249938965,
            0.23181326687335968,
            0.21943333745002747,
            0.1910613775253296,
            0.20081698894500732,
            0.15282495319843292,
            0.15628699958324432,
            0.1297311931848526,
            0.1581582874059677,
            0.1307096928358078,
            0.1449698954820633
         ],
         "val_accuracy": [
            0.7101638913154602,
            0.8081607222557068,
            0.860971987247467,
            0.8893125653266907,
            0.9076371788978577,
            0.9251081347465515,
            0.9276690483093262,
            0.9346118569374084,
            0.9318802356719971,
            0.949066698551178,
            0.9500341415405273,
            0.958172082901001,
            0.9479854106903076,
            0.9565786719322205,
            0.9530503153800964
         ]
      }
   }
}