{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "SGD",
      "learning_rate": "0.125",
      "decay": 0.0,
      "momentum": "0.1",
      "nesterov": false,
      "str_float": [
         "learning_rate",
         "momentum"
      ]
   },
   "params": {
      "ep": 15,
      "batch_size": 64,
      "learning_rate": 0.125,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 1293.7236053943634,
      "history": {
         "loss": [
            3.4412899017333984,
            2.104099988937378,
            1.0381935834884644,
            0.546019434928894,
            0.3451351523399353,
            0.4133946895599365,
            0.27693501114845276,
            0.16114729642868042,
            0.11840963363647461,
            0.09832673519849777,
            0.07139834016561508,
            0.0686950609087944,
            0.05793628469109535,
            0.042015913873910904,
            0.03628364950418472
         ],
         "accuracy": [
            0.07095383107662201,
            0.3735947012901306,
            0.6745209693908691,
            0.8247365951538086,
            0.8874531388282776,
            0.8776249885559082,
            0.911740779876709,
            0.9471646547317505,
            0.9613943099975586,
            0.968411922454834,
            0.976507842540741,
            0.9775683879852295,
            0.9817400574684143,
            0.9874319434165955,
            0.9887046813964844
         ],
         "val_loss": [
            2.809729814529419,
            1.2765922546386719,
            0.6104347109794617,
            0.5815733075141907,
            0.3443601131439209,
            0.3768683969974518,
            0.2187536060810089,
            0.17528259754180908,
            0.18829935789108276,
            0.22009636461734772,
            0.16666732728481293,
            0.16113591194152832,
            0.1513732522726059,
            0.158704936504364,
            0.198200523853302
         ],
         "val_accuracy": [
            0.17152287065982819,
            0.5965172052383423,
            0.8045185804367065,
            0.8113476037979126,
            0.8876621723175049,
            0.8826542496681213,
            0.9313681125640869,
            0.9447416067123413,
            0.9459936022758484,
            0.9384247660636902,
            0.9508877992630005,
            0.954131543636322,
            0.9593671560287476,
            0.9588549733161926,
            0.9509446620941162
         ]
      }
   }
}