{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "SGD",
      "clipvalue": 1.0,
      "learning_rate": "0.125",
      "decay": 0.0,
      "momentum": "0.1",
      "nesterov": false,
      "str_float": [
         "learning_rate",
         "momentum"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 32,
      "learning_rate": 0.125,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2701.366541147232,
      "history": {
         "loss": [
            3.0254833698272705,
            1.3043984174728394,
            0.6265732645988464,
            0.4020669460296631,
            0.2889692187309265,
            0.23374347388744354,
            0.20586423575878143,
            0.16490982472896576,
            0.15622851252555847,
            0.15320329368114471,
            0.16142478585243225,
            0.15178881585597992,
            0.1652432531118393,
            0.18510285019874573,
            0.1842438280582428,
            0.15624304115772247,
            0.19906283915042877,
            0.18424488604068756,
            0.19746936857700348,
            0.22322499752044678,
            0.25202134251594543,
            0.3202275037765503,
            0.3422093689441681,
            0.4526319205760956,
            0.4434373080730438,
            58.914833068847656,
            3.3066213130950928,
            2.352956533432007,
            1.7431199550628662,
            1.5100178718566895
         ],
         "accuracy": [
            0.16023828089237213,
            0.5990772843360901,
            0.8071660995483398,
            0.8766350746154785,
            0.9115993976593018,
            0.928745687007904,
            0.9396344423294067,
            0.9507176876068115,
            0.9548540115356445,
            0.9568514227867126,
            0.9541292786598206,
            0.9581241607666016,
            0.9553312659263611,
            0.9520257115364075,
            0.9532454013824463,
            0.9588135480880737,
            0.9511949419975281,
            0.9539524912834167,
            0.9513186812400818,
            0.9458035826683044,
            0.9401647448539734,
            0.9282153844833374,
            0.9242557883262634,
            0.9015767574310303,
            0.9032206535339355,
            0.561850368976593,
            0.09656720608472824,
            0.3167998194694519,
            0.478664368391037,
            0.5464364290237427
         ],
         "val_loss": [
            1.881801962852478,
            0.9801592230796814,
            0.4145793616771698,
            0.2938072383403778,
            0.2688450813293457,
            0.26202747225761414,
            0.20466281473636627,
            0.1830894649028778,
            0.18979999423027039,
            0.29452767968177795,
            0.2641166150569916,
            0.20393283665180206,
            0.24056199193000793,
            0.27206820249557495,
            0.24214781820774078,
            0.21861062943935394,
            0.2874079644680023,
            0.28877919912338257,
            0.32197681069374084,
            0.47096681594848633,
            0.3341241478919983,
            0.32412266731262207,
            0.2934182286262512,
            0.5130731463432312,
            0.5433648824691772,
            3.4563698768615723,
            2.763018846511841,
            1.7472881078720093,
            1.4668201208114624,
            1.296592354774475
         ],
         "val_accuracy": [
            0.42391303181648254,
            0.7036762833595276,
            0.8716708421707153,
            0.9079216718673706,
            0.9165717959403992,
            0.9194172620773315,
            0.9405872821807861,
            0.9454245567321777,
            0.9432051181793213,
            0.9232301115989685,
            0.9237992167472839,
            0.9470748901367188,
            0.9396767616271973,
            0.932506263256073,
            0.9344411492347717,
            0.9428636431694031,
            0.9267584681510925,
            0.9231163263320923,
            0.9219212532043457,
            0.8896539807319641,
            0.9173685312271118,
            0.9239699244499207,
            0.9309127926826477,
            0.8840200304985046,
            0.8759390115737915,
            0.06316867470741272,
            0.2069770097732544,
            0.47302526235580444,
            0.5542340278625488,
            0.609207808971405
         ]
      }
   }
}