{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adagrad",
      "learning_rate": "1.0",
      "decay": 0.0,
      "initial_accumulator_value": 0.1,
      "epsilon": 1e-07,
      "str_float": [
         "learning_rate"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 32,
      "learning_rate": 1.0,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2487.2526276111603,
      "history": {
         "loss": [
            32549128192.0,
            3.6403448581695557,
            3.639360189437866,
            3.63874888420105,
            3.6384429931640625,
            3.638145685195923,
            3.637881278991699,
            3.637808322906494,
            3.637646436691284,
            3.637519359588623,
            3.6373913288116455,
            3.6373300552368164,
            3.6372487545013428,
            3.6371982097625732,
            3.637155532836914,
            3.637058973312378,
            3.637002944946289,
            3.636964797973633,
            3.6369173526763916,
            3.6368980407714844,
            3.636843681335449,
            3.6368112564086914,
            3.6367993354797363,
            3.6367766857147217,
            3.6367361545562744,
            3.6366944313049316,
            3.636678457260132,
            3.636631488800049,
            3.6366195678710938,
            3.6366117000579834
         ],
         "accuracy": [
            0.02944919839501381,
            0.03075726516544819,
            0.031641095876693726,
            0.03107544407248497,
            0.03257795423269272,
            0.033037543296813965,
            0.03287845477461815,
            0.03317895904183388,
            0.033037543296813965,
            0.0333910770714283,
            0.03328501805663109,
            0.03353248909115791,
            0.03351481258869171,
            0.03356784209609032,
            0.033656224608421326,
            0.033656224608421326,
            0.03369157761335373,
            0.03362087160348892,
            0.03360319510102272,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.033638548105955124,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993
         ],
         "val_loss": [
            3.639958143234253,
            3.638723850250244,
            3.6379172801971436,
            3.6378867626190186,
            3.637619972229004,
            3.6375362873077393,
            3.637450933456421,
            3.63740873336792,
            3.6373977661132812,
            3.6373531818389893,
            3.6373090744018555,
            3.6372716426849365,
            3.6372289657592773,
            3.6372244358062744,
            3.6372175216674805,
            3.6371634006500244,
            3.6371726989746094,
            3.6371397972106934,
            3.6371710300445557,
            3.63714599609375,
            3.6370902061462402,
            3.637132406234741,
            3.637115716934204,
            3.63708233833313,
            3.6370673179626465,
            3.6370840072631836,
            3.637068271636963,
            3.637056827545166,
            3.6370110511779785,
            3.6370584964752197
         ],
         "val_accuracy": [
            0.026348736137151718,
            0.026348736137151718,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832
         ]
      }
   }
}