{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adagrad",
      "learning_rate": "0.01",
      "decay": 0.0,
      "initial_accumulator_value": 0.6,
      "epsilon": 1e-07,
      "str_float": [
         "learning_rate"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 32,
      "learning_rate": 0.01,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2585.2088651657104,
      "history": {
         "loss": [
            3.5651519298553467,
            2.5607314109802246,
            1.4736212491989136,
            0.9141584038734436,
            0.6338756680488586,
            0.4738067090511322,
            0.3714035153388977,
            0.30269894003868103,
            0.2514592111110687,
            0.21055622398853302,
            0.1818128377199173,
            0.15771029889583588,
            0.13609321415424347,
            0.11781769245862961,
            0.1017676591873169,
            0.09453924745321274,
            0.08300618827342987,
            0.07227566838264465,
            0.06654460728168488,
            0.05749095603823662,
            0.05210180580615997,
            0.04703724756836891,
            0.04086530581116676,
            0.04109954833984375,
            0.03448913246393204,
            0.032911039888858795,
            0.03137506544589996,
            0.02701680175960064,
            0.024973629042506218,
            0.022430649027228355
         ],
         "accuracy": [
            0.04977727681398392,
            0.26880788803100586,
            0.550625741481781,
            0.7131796479225159,
            0.7975853681564331,
            0.8478045463562012,
            0.8805946111679077,
            0.9004985094070435,
            0.9166371822357178,
            0.9314324855804443,
            0.93905109167099,
            0.9474828243255615,
            0.9547656178474426,
            0.9606165885925293,
            0.9651771187782288,
            0.9681644439697266,
            0.9726012945175171,
            0.9755886197090149,
            0.9783638715744019,
            0.9807502031326294,
            0.9828183650970459,
            0.9840556979179382,
            0.9862829446792603,
            0.9861946105957031,
            0.9887046813964844,
            0.9890758395195007,
            0.9897652268409729,
            0.9909142255783081,
            0.9917804002761841,
            0.9925581812858582
         ],
         "val_loss": [
            3.3121330738067627,
            1.7207590341567993,
            0.9979380369186401,
            0.6376436352729797,
            0.4375074803829193,
            0.3616947531700134,
            0.25753599405288696,
            0.2652028203010559,
            0.21112152934074402,
            0.17717278003692627,
            0.16546738147735596,
            0.15784278512001038,
            0.1358364075422287,
            0.1280943602323532,
            0.12146671116352081,
            0.11030503362417221,
            0.0971490815281868,
            0.11304108798503876,
            0.10618507862091064,
            0.0951426774263382,
            0.08621980249881744,
            0.09523794800043106,
            0.08800924569368362,
            0.08360534906387329,
            0.10360054671764374,
            0.07992969453334808,
            0.07986943423748016,
            0.0775536522269249,
            0.08935795724391937,
            0.08156683295965195
         ],
         "val_accuracy": [
            0.13288186490535736,
            0.49180513620376587,
            0.6955952644348145,
            0.7994536757469177,
            0.8589801788330078,
            0.8824834823608398,
            0.9154336452484131,
            0.9124743938446045,
            0.930742084980011,
            0.9412133097648621,
            0.9449692964553833,
            0.9470748901367188,
            0.9545299410820007,
            0.957773745059967,
            0.9617573618888855,
            0.9632938504219055,
            0.9693831205368042,
            0.9623264074325562,
            0.9643182158470154,
            0.9685863852500916,
            0.9720578193664551,
            0.9693831205368042,
            0.9717163443565369,
            0.974334180355072,
            0.9683587551116943,
            0.9751877784729004,
            0.9747894406318665,
            0.9761552214622498,
            0.9731391072273254,
            0.976496696472168
         ]
      }
   }
}