{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adagrad",
      "learning_rate": "0.01",
      "decay": 0.0,
      "initial_accumulator_value": 0.1,
      "epsilon": 1e-06,
      "str_float": [
         "learning_rate"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 32,
      "learning_rate": 0.01,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2519.45943236351,
      "history": {
         "loss": [
            3.205589532852173,
            1.5070422887802124,
            0.7975665330886841,
            0.49022457003593445,
            0.3357795476913452,
            0.2487298548221588,
            0.1918802708387375,
            0.1505122035741806,
            0.12353505194187164,
            0.10140924900770187,
            0.08513882756233215,
            0.06972035020589828,
            0.061441149562597275,
            0.05128902941942215,
            0.04247814789414406,
            0.037027403712272644,
            0.031156744807958603,
            0.027541907504200935,
            0.024465005844831467,
            0.02378402091562748,
            0.01844163052737713,
            0.018409693613648415,
            0.015770483762025833,
            0.015193314291536808,
            0.01377884205430746,
            0.012561310082674026,
            0.011937848292291164,
            0.009873459115624428,
            0.010344968177378178,
            0.009016275405883789
         ],
         "accuracy": [
            0.1224634125828743,
            0.5398430228233337,
            0.7445379495620728,
            0.840893030166626,
            0.8896627426147461,
            0.9183871746063232,
            0.9367355108261108,
            0.9502580761909485,
            0.9591140747070312,
            0.9653539061546326,
            0.9718058109283447,
            0.976101279258728,
            0.9790179133415222,
            0.9826946258544922,
            0.9860885143280029,
            0.9876087307929993,
            0.989959716796875,
            0.9910379648208618,
            0.9919748306274414,
            0.9923283457756042,
            0.994272768497467,
            0.9941667318344116,
            0.9951212406158447,
            0.9952803254127502,
            0.9955278038978577,
            0.9960227608680725,
            0.9961465001106262,
            0.9971717596054077,
            0.9968535900115967,
            0.9969242811203003
         ],
         "val_loss": [
            2.0139238834381104,
            0.916592538356781,
            0.5236204862594604,
            0.35991370677948,
            0.2610483467578888,
            0.19291865825653076,
            0.1913384646177292,
            0.13104622066020966,
            0.12828198075294495,
            0.1209079772233963,
            0.10653980821371078,
            0.10814162343740463,
            0.08792338520288467,
            0.09043236821889877,
            0.08019369095563889,
            0.08672972768545151,
            0.08610876649618149,
            0.07962843030691147,
            0.08247867226600647,
            0.0822267085313797,
            0.08009364455938339,
            0.07853464037179947,
            0.08709105104207993,
            0.0775749608874321,
            0.0806652307510376,
            0.08212403208017349,
            0.08744350075721741,
            0.0717988908290863,
            0.07510741055011749,
            0.07682739198207855
         ],
         "val_accuracy": [
            0.4190758168697357,
            0.7202367186546326,
            0.8282495141029358,
            0.8833940625190735,
            0.912417471408844,
            0.936034619808197,
            0.9348964095115662,
            0.9569200873374939,
            0.9561233520507812,
            0.959822416305542,
            0.9648303985595703,
            0.9652856588363647,
            0.970919668674469,
            0.9703505635261536,
            0.9735374450683594,
            0.9721147418022156,
            0.9727407097816467,
            0.9749032258987427,
            0.9743911027908325,
            0.9743911027908325,
            0.9751309156417847,
            0.9746755957603455,
            0.9737650752067566,
            0.9769519567489624,
            0.9756999611854553,
            0.9762690663337708,
            0.9740496277809143,
            0.9790006875991821,
            0.9778056144714355,
            0.9783177971839905
         ]
      }
   }
}