{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adagrad",
      "learning_rate": "0.01",
      "decay": 0.0,
      "initial_accumulator_value": 0.1,
      "epsilon": 1e-07,
      "str_float": [
         "learning_rate"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 32,
      "learning_rate": 0.01,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2556.3127665519714,
      "history": {
         "loss": [
            3.162991762161255,
            1.4277006387710571,
            0.735990583896637,
            0.4762597680091858,
            0.3306618630886078,
            0.2444278746843338,
            0.1912529319524765,
            0.15131773054599762,
            0.12041693925857544,
            0.09751925617456436,
            0.08218900114297867,
            0.06902816146612167,
            0.05901501327753067,
            0.05138521268963814,
            0.0421205535531044,
            0.038990382105112076,
            0.03230071812868118,
            0.028910694643855095,
            0.024306870996952057,
            0.022087210789322853,
            0.019833549857139587,
            0.017137017101049423,
            0.01672470197081566,
            0.014713556505739689,
            0.012262088246643543,
            0.012193462811410427,
            0.010417690500617027,
            0.00839611142873764,
            0.010726519860327244,
            0.009453386068344116
         ],
         "accuracy": [
            0.12808457016944885,
            0.5633352398872375,
            0.7659443020820618,
            0.8461429476737976,
            0.8934808969497681,
            0.9205083847045898,
            0.9363996386528015,
            0.9496747255325317,
            0.9604398012161255,
            0.9674043655395508,
            0.9721240401268005,
            0.9765961766242981,
            0.9800608158111572,
            0.9825001955032349,
            0.9859647750854492,
            0.9872375130653381,
            0.9890581965446472,
            0.9902071952819824,
            0.9918864369392395,
            0.9931945204734802,
            0.9934773445129395,
            0.9948561191558838,
            0.9949268102645874,
            0.9953687191009521,
            0.9961995482444763,
            0.996181845664978,
            0.9968535900115967,
            0.9976667165756226,
            0.9966061115264893,
            0.997224748134613
         ],
         "val_loss": [
            1.954364538192749,
            0.8473737239837646,
            0.5138584971427917,
            0.4523613750934601,
            0.22743789851665497,
            0.21072688698768616,
            0.19132237136363983,
            0.13669916987419128,
            0.12853866815567017,
            0.11389662325382233,
            0.11800981312990189,
            0.09720911830663681,
            0.09361088275909424,
            0.09404779970645905,
            0.08863859623670578,
            0.08654056489467621,
            0.08159444481134415,
            0.08308713138103485,
            0.08019851893186569,
            0.08123520761728287,
            0.07971710711717606,
            0.0726308673620224,
            0.07714428752660751,
            0.08088268339633942,
            0.0827796533703804,
            0.07374768704175949,
            0.06973688304424286,
            0.07192759960889816,
            0.09101076424121857,
            0.07087092101573944
         ],
         "val_accuracy": [
            0.43324607610702515,
            0.7349761128425598,
            0.8309811353683472,
            0.8530047535896301,
            0.926701545715332,
            0.9314818978309631,
            0.936546802520752,
            0.954359233379364,
            0.9573184847831726,
            0.9631231427192688,
            0.9609606266021729,
            0.9684725403785706,
            0.9705781936645508,
            0.9706920385360718,
            0.9720578193664551,
            0.9734805226325989,
            0.9753016233444214,
            0.9762121438980103,
            0.9768950343132019,
            0.9768381714820862,
            0.9774072170257568,
            0.9798542857170105,
            0.977634847164154,
            0.9767243266105652,
            0.975984513759613,
            0.9799681305885315,
            0.9811632037162781,
            0.9802526831626892,
            0.9761552214622498,
            0.9804803133010864
         ]
      }
   }
}