{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adagrad",
      "learning_rate": "0.01",
      "decay": 0.0,
      "initial_accumulator_value": 0.1,
      "epsilon": 0.0001,
      "str_float": [
         "learning_rate"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 32,
      "learning_rate": 0.01,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2730.2084538936615,
      "history": {
         "loss": [
            3.1022934913635254,
            1.3584721088409424,
            0.722020149230957,
            0.452540785074234,
            0.31438910961151123,
            0.23878706991672516,
            0.18188782036304474,
            0.1471850723028183,
            0.12002351135015488,
            0.09939877688884735,
            0.0803428366780281,
            0.06831546127796173,
            0.05482466146349907,
            0.04999742656946182,
            0.04290159046649933,
            0.03574049845337868,
            0.03130722418427467,
            0.02452133223414421,
            0.024025162681937218,
            0.021574176847934723,
            0.018905887380242348,
            0.018694274127483368,
            0.016596246510744095,
            0.013475962914526463,
            0.012621267698705196,
            0.010576294735074043,
            0.011078019626438618,
            0.009824102744460106,
            0.01052775513380766,
            0.008724618703126907
         ],
         "accuracy": [
            0.15300855040550232,
            0.5790320038795471,
            0.7689316272735596,
            0.8528777360916138,
            0.8965566158294678,
            0.9207912087440491,
            0.9385384917259216,
            0.950098991394043,
            0.9598211050033569,
            0.9660962820053101,
            0.9729548096656799,
            0.9765785336494446,
            0.9817931056022644,
            0.9831188321113586,
            0.9857880473136902,
            0.9885278940200806,
            0.9891112446784973,
            0.9922753572463989,
            0.9920985698699951,
            0.9933536052703857,
            0.993954598903656,
            0.9938662052154541,
            0.9946616888046265,
            0.9957752823829651,
            0.9957929849624634,
            0.9966768026351929,
            0.9964646697044373,
            0.9971364140510559,
            0.9967828392982483,
            0.9971717596054077
         ],
         "val_loss": [
            1.758831262588501,
            0.817949652671814,
            0.44180136919021606,
            0.3238120675086975,
            0.25479230284690857,
            0.1816137433052063,
            0.16743755340576172,
            0.17912335693836212,
            0.131363183259964,
            0.11462748050689697,
            0.10838660597801208,
            0.1014414057135582,
            0.0949246883392334,
            0.11099129170179367,
            0.09565950930118561,
            0.08461278676986694,
            0.08807844668626785,
            0.08698228746652603,
            0.08979298174381256,
            0.08733970671892166,
            0.0887860655784607,
            0.09538780897855759,
            0.08342604339122772,
            0.09658318012952805,
            0.08228183537721634,
            0.08715653419494629,
            0.07861147820949554,
            0.08038388937711716,
            0.09708238393068314,
            0.07993191480636597
         ],
         "val_accuracy": [
            0.48247212171554565,
            0.748235821723938,
            0.855793297290802,
            0.8939790725708008,
            0.9131572842597961,
            0.9384247660636902,
            0.9436034560203552,
            0.9427498579025269,
            0.9553266763687134,
            0.9631231427192688,
            0.9635784029960632,
            0.9666514992713928,
            0.9688140153884888,
            0.9650580286979675,
            0.9696676731109619,
            0.9732528924942017,
            0.9716025590896606,
            0.9715456366539001,
            0.9720008969306946,
            0.9730252623558044,
            0.9739927053451538,
            0.9721716642379761,
            0.9749032258987427,
            0.9722285270690918,
            0.9768950343132019,
            0.9742772579193115,
            0.9769519567489624,
            0.9775779843330383,
            0.97257000207901,
            0.9772365093231201
         ]
      }
   }
}