{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adagrad",
      "learning_rate": "0.1",
      "decay": 0.0,
      "initial_accumulator_value": 0.1,
      "epsilon": 1e-07,
      "str_float": [
         "learning_rate"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 32,
      "learning_rate": 0.1,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2521.8039672374725,
      "history": {
         "loss": [
            3.6377499103546143,
            3.6363279819488525,
            3.635828733444214,
            3.6356968879699707,
            3.6355843544006348,
            3.635530471801758,
            3.6354939937591553,
            3.6354823112487793,
            3.6354494094848633,
            3.6354308128356934,
            3.635406732559204,
            3.6353867053985596,
            3.635373592376709,
            3.6353602409362793,
            3.635350227355957,
            3.635340690612793,
            3.6353352069854736,
            3.635329246520996,
            3.6353135108947754,
            3.6353113651275635,
            3.6353166103363037,
            3.635293960571289,
            3.635298728942871,
            3.6352944374084473,
            3.6352882385253906,
            3.635270833969116,
            3.6352734565734863,
            3.6352663040161133,
            3.635263442993164,
            3.635266065597534
         ],
         "accuracy": [
            0.03266633674502373,
            0.03392137587070465,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993,
            0.03370925411581993
         ],
         "val_loss": [
            3.636857509613037,
            3.636812686920166,
            3.6367273330688477,
            3.636747121810913,
            3.6367664337158203,
            3.636715888977051,
            3.636730909347534,
            3.6367223262786865,
            3.63671875,
            3.6367251873016357,
            3.6367170810699463,
            3.6367175579071045,
            3.6367151737213135,
            3.6367127895355225,
            3.636709451675415,
            3.6367058753967285,
            3.6367111206054688,
            3.636704921722412,
            3.6367063522338867,
            3.6367316246032715,
            3.6367032527923584,
            3.6367082595825195,
            3.636712074279785,
            3.6367087364196777,
            3.636707067489624,
            3.6367058753967285,
            3.6367077827453613,
            3.6367077827453613,
            3.6367080211639404,
            3.636707067489624
         ],
         "val_accuracy": [
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832,
            0.02714545838534832
         ]
      }
   }
}