{
   "name": "base15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_20_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_20",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_6",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_21",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_7",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_22",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_8",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_23",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_9",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_24",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_2",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_4",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_5",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_6",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "SGD",
      "learning_rate": "0.01",
      "decay": 0.0,
      "momentum": "0.3",
      "nesterov": false,
      "str_float": [
         "learning_rate",
         "momentum"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 32,
      "learning_rate": 0.01,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2598.9279775619507,
      "history": {
         "loss": [
            3.5066075325012207,
            2.0229289531707764,
            0.9972917437553406,
            0.6109061241149902,
            0.4224444627761841,
            0.3144332766532898,
            0.24339915812015533,
            0.1955500990152359,
            0.15734753012657166,
            0.13573701679706573,
            0.11217837035655975,
            0.09545651823282242,
            0.08169884234666824,
            0.06790301948785782,
            0.062038734555244446,
            0.05447648465633392,
            0.047628384083509445,
            0.04027486965060234,
            0.03469482436776161,
            0.0342126227915287,
            0.030696211382746696,
            0.02563355304300785,
            0.022264117375016212,
            0.02207997627556324,
            0.017478203400969505,
            0.017827488481998444,
            0.02000497654080391,
            0.0148563077673316,
            0.015268382616341114,
            0.01308367494493723
         ],
         "accuracy": [
            0.06321148574352264,
            0.4057130813598633,
            0.6870890259742737,
            0.8035600781440735,
            0.8626528978347778,
            0.896839439868927,
            0.9199250340461731,
            0.9344728589057922,
            0.9461394548416138,
            0.9550484418869019,
            0.9622781872749329,
            0.9677932262420654,
            0.9728487730026245,
            0.9772679209709167,
            0.9782224297523499,
            0.9816340208053589,
            0.98409104347229,
            0.9862475991249084,
            0.988050639629364,
            0.9882627725601196,
            0.9893763661384583,
            0.9908965826034546,
            0.9929470419883728,
            0.9931238293647766,
            0.9942374229431152,
            0.9942551255226135,
            0.9936010837554932,
            0.995404064655304,
            0.9952096343040466,
            0.9959697127342224
         ],
         "val_loss": [
            2.8233044147491455,
            1.2065447568893433,
            0.5965356826782227,
            0.5837758779525757,
            0.2713041305541992,
            0.2148766964673996,
            0.18189692497253418,
            0.16672661900520325,
            0.1405254751443863,
            0.1208145022392273,
            0.13230463862419128,
            0.1582770049571991,
            0.14277653396129608,
            0.10652411729097366,
            0.13972003757953644,
            0.08949838578701019,
            0.08249033242464066,
            0.0898657888174057,
            0.09655173122882843,
            0.1144275814294815,
            0.08943574130535126,
            0.0856943354010582,
            0.10080531239509583,
            0.07945021241903305,
            0.09672260284423828,
            0.08783724159002304,
            0.07684922963380814,
            0.08447635918855667,
            0.06907035410404205,
            0.11109936237335205
         ],
         "val_accuracy": [
            0.23355337977409363,
            0.6282153129577637,
            0.8053152561187744,
            0.8147051930427551,
            0.9088322520256042,
            0.9288071990013123,
            0.9397336840629578,
            0.945026159286499,
            0.9516844749450684,
            0.9596517086029053,
            0.9575461149215698,
            0.9471887350082397,
            0.9531641006469727,
            0.9647166132926941,
            0.9570339322090149,
            0.9702367186546326,
            0.974846363067627,
            0.9716594815254211,
            0.9698383808135986,
            0.9665945768356323,
            0.9735943675041199,
            0.9757568836212158,
            0.9712610840797424,
            0.9771795868873596,
            0.9737650752067566,
            0.9762121438980103,
            0.9786592125892639,
            0.9780332446098328,
            0.9796266555786133,
            0.9700090885162354
         ]
      }
   }
}