{
   "name": "fReduced15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_49_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_49",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 16,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_22",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_50",
            "trainable": true,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_23",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_51",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_24",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_52",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_25",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_53",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_6",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_16",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_10",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_17",
            "trainable": true,
            "dtype": "float32",
            "units": 576,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_11",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_18",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adam",
      "learning_rate": "1e-04",
      "decay": 0.0,
      "beta_1": "0.9",
      "beta_2": "0.999",
      "epsilon": 1e-07,
      "amsgrad": false,
      "str_float": [
         "learning_rate",
         "beta_1",
         "beta_2"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 32,
      "learning_rate": 0.0001,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 1586.8684775829315,
      "history": {
         "loss": [
            2.587921619415283,
            1.2932566404342651,
            0.8777676224708557,
            0.6583448648452759,
            0.5160992741584778,
            0.41575759649276733,
            0.34235575795173645,
            0.28316664695739746,
            0.23700463771820068,
            0.2037709504365921,
            0.17415930330753326,
            0.1532128006219864,
            0.1321222186088562,
            0.11318454146385193,
            0.10301932692527771,
            0.09626808762550354,
            0.08243206888437271,
            0.07692121714353561,
            0.06695463508367538,
            0.061374980956315994,
            0.054505057632923126,
            0.05571114644408226,
            0.04872538149356842,
            0.04652940854430199,
            0.04112399369478226,
            0.0403776578605175,
            0.03609712794423103,
            0.03574548289179802,
            0.03728574514389038,
            0.031410783529281616
         ],
         "accuracy": [
            0.26368167996406555,
            0.6019585728645325,
            0.7243159413337708,
            0.7930248379707336,
            0.8358728885650635,
            0.8668776154518127,
            0.8904405236244202,
            0.9090185761451721,
            0.9233189821243286,
            0.9330410957336426,
            0.9425157308578491,
            0.9490383863449097,
            0.9564448595046997,
            0.9615533947944641,
            0.9654422402381897,
            0.9674043655395508,
            0.9724775552749634,
            0.9742982387542725,
            0.9779042601585388,
            0.9793714284896851,
            0.9817047119140625,
            0.9810330271720886,
            0.9838789701461792,
            0.9846743941307068,
            0.9864597320556641,
            0.9863182902336121,
            0.9872905611991882,
            0.988315761089325,
            0.9874672889709473,
            0.9895707964897156
         ],
         "val_loss": [
            1.3789653778076172,
            0.823140025138855,
            0.6028278470039368,
            0.4565392732620239,
            0.3748495280742645,
            0.3248694837093353,
            0.3153591454029083,
            0.24761539697647095,
            0.18988817930221558,
            0.175449937582016,
            0.15407265722751617,
            0.14384549856185913,
            0.13939936459064484,
            0.13348489999771118,
            0.18336130678653717,
            0.12133967131376266,
            0.13808073103427887,
            0.10881427675485611,
            0.12376432120800018,
            0.11506087332963943,
            0.09530630707740784,
            0.11317116767168045,
            0.11708268523216248,
            0.12400069087743759,
            0.10964464396238327,
            0.10748130828142166,
            0.12464632093906403,
            0.09231668710708618,
            0.11563742905855179,
            0.13485300540924072
         ],
         "val_accuracy": [
            0.5923059582710266,
            0.7525039911270142,
            0.8127133846282959,
            0.8546551465988159,
            0.879296600818634,
            0.8950603008270264,
            0.8975642919540405,
            0.9162873029708862,
            0.9366605877876282,
            0.9410994648933411,
            0.9483838081359863,
            0.9509446620941162,
            0.9544160962104797,
            0.9562941193580627,
            0.9412702322006226,
            0.9589688181877136,
            0.9561233520507812,
            0.9663100242614746,
            0.9610744118690491,
            0.9636922478675842,
            0.9706920385360718,
            0.9643751382827759,
            0.9648873209953308,
            0.9612451791763306,
            0.9668222069740295,
            0.969041645526886,
            0.9645458459854126,
            0.9723992943763733,
            0.9646596908569336,
            0.9611313343048096
         ]
      }
   }
}