{
   "name": "preBase15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_54_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_54",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_26",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_55",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_27",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_56",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_28",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_7",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_19",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_12",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_20",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_13",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_21",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adam",
      "learning_rate": "1e-04",
      "decay": 0.0,
      "beta_1": "0.9",
      "beta_2": "0.999",
      "epsilon": 1e-07,
      "amsgrad": false,
      "str_float": [
         "learning_rate",
         "beta_1",
         "beta_2"
      ]
   },
   "params": {
      "ep": 30,
      "batch_size": 32,
      "learning_rate": 0.0001,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 2602.2971255779266,
      "history": {
         "loss": [
            1.7760529518127441,
            0.7557209730148315,
            0.4816388487815857,
            0.34534016251564026,
            0.26087701320648193,
            0.20224343240261078,
            0.16071243584156036,
            0.132709801197052,
            0.10863973200321198,
            0.09274577349424362,
            0.08008220791816711,
            0.06841959804296494,
            0.056814584881067276,
            0.05670689791440964,
            0.050707899034023285,
            0.042726002633571625,
            0.03890928998589516,
            0.03918985277414322,
            0.03264819085597992,
            0.032578833401203156,
            0.028455445542931557,
            0.029697265475988388,
            0.027885282412171364,
            0.023321857675909996,
            0.022875918075442314,
            0.02420688606798649,
            0.023421593010425568,
            0.020770754665136337,
            0.02073989249765873,
            0.01802501641213894
         ],
         "accuracy": [
            0.4887400269508362,
            0.7636109590530396,
            0.8470975160598755,
            0.8886021375656128,
            0.9153821468353271,
            0.9334476590156555,
            0.9468818306922913,
            0.956462562084198,
            0.9636215567588806,
            0.9687477946281433,
            0.9736441969871521,
            0.9773916602134705,
            0.981545627117157,
            0.9813865423202515,
            0.9831365346908569,
            0.9858763813972473,
            0.9869369864463806,
            0.9865304231643677,
            0.9893763661384583,
            0.9889344573020935,
            0.9906137585639954,
            0.9902248382568359,
            0.9907374382019043,
            0.9922223091125488,
            0.992363691329956,
            0.9922930002212524,
            0.9922399520874023,
            0.9931238293647766,
            0.9931414723396301,
            0.9946263432502747
         ],
         "val_loss": [
            0.8179078102111816,
            0.4358963072299957,
            0.32148975133895874,
            0.2282518595457077,
            0.1939382702112198,
            0.17087803781032562,
            0.16634899377822876,
            0.1628328114748001,
            0.14002682268619537,
            0.12096459418535233,
            0.11123102903366089,
            0.12139815092086792,
            0.11426050961017609,
            0.1705034077167511,
            0.1188410073518753,
            0.10425024479627609,
            0.11629514396190643,
            0.10594446957111359,
            0.11707989126443863,
            0.10387822240591049,
            0.11732343584299088,
            0.1073317602276802,
            0.09891730546951294,
            0.12141849100589752,
            0.09722446650266647,
            0.09736593812704086,
            0.10487807542085648,
            0.1166326254606247,
            0.11459730565547943,
            0.126713827252388
         ],
         "val_accuracy": [
            0.7558615803718567,
            0.8662645220756531,
            0.8976781368255615,
            0.9261893630027771,
            0.9372866153717041,
            0.9439449310302734,
            0.946790337562561,
            0.9464489221572876,
            0.9556112289428711,
            0.9613020420074463,
            0.9643751382827759,
            0.9622695446014404,
            0.9632369875907898,
            0.9483838081359863,
            0.9644889831542969,
            0.9679034948348999,
            0.9677896499633789,
            0.9694969058036804,
            0.9671636819839478,
            0.9712041616439819,
            0.9681880474090576,
            0.9706920385360718,
            0.9734236001968384,
            0.9679604172706604,
            0.9734236001968384,
            0.9751309156417847,
            0.9731391072273254,
            0.9697245359420776,
            0.9710334539413452,
            0.9679034948348999
         ]
      }
   }
}