{
   "name": "spatial15m",
   "layers": [
      {
         "class_name": "InputLayer",
         "config": {
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv2d_41_input"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_41",
            "trainable": true,
            "batch_input_shape": [
               null,
               256,
               256,
               3
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_18",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_42",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_19",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_43",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "SpatialDropout2D",
         "config": {
            "name": "spatial_dropout2d",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_44",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_20",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_45",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "SpatialDropout2D",
         "config": {
            "name": "spatial_dropout2d_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_46",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "name": "max_pooling2d_21",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
               3,
               3
            ],
            "padding": "valid",
            "strides": [
               3,
               3
            ],
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_47",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "SpatialDropout2D",
         "config": {
            "name": "spatial_dropout2d_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "name": "conv2d_48",
            "trainable": true,
            "dtype": "float32",
            "filters": 512,
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
               1,
               1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Flatten",
         "config": {
            "name": "flatten_5",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_13",
            "trainable": true,
            "dtype": "float32",
            "units": 2304,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_8",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_14",
            "trainable": true,
            "dtype": "float32",
            "units": 1152,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "name": "dropout_9",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
         }
      },
      {
         "class_name": "Dense",
         "config": {
            "name": "dense_15",
            "trainable": true,
            "dtype": "float32",
            "units": 38,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
               "class_name": "GlorotUniform",
               "config": {
                  "seed": null
               }
            },
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
         }
      }
   ],
   "opt": {
      "name": "Adam",
      "learning_rate": "1e-04",
      "decay": 0.0,
      "beta_1": "0.9",
      "beta_2": "0.999",
      "epsilon": 1e-07,
      "amsgrad": false,
      "str_float": [
         "learning_rate",
         "beta_1",
         "beta_2"
      ]
   },
   "params": {
      "ep": 50,
      "batch_size": 32,
      "learning_rate": 0.0001,
      "loss": "sparse_categorical_crossentropy",
      "train_time": 5228.383746623993,
      "history": {
         "loss": [
            2.705495595932007,
            1.2339332103729248,
            0.7738152146339417,
            0.5426854491233826,
            0.41067156195640564,
            0.32495710253715515,
            0.2631760239601135,
            0.22099025547504425,
            0.19043022394180298,
            0.16244134306907654,
            0.13751398026943207,
            0.12680518627166748,
            0.10817036777734756,
            0.09781531989574432,
            0.09278641641139984,
            0.07894261926412582,
            0.07747634500265121,
            0.06860323250293732,
            0.06520697474479675,
            0.05927922576665878,
            0.057472631335258484,
            0.05867956951260567,
            0.05098099261522293,
            0.05058089643716812,
            0.043643660843372345,
            0.04686657711863518,
            0.04203717038035393,
            0.04515223950147629,
            0.036576107144355774,
            0.03931122645735741,
            0.03697057068347931,
            0.03828692063689232,
            0.03226492553949356,
            0.03274720907211304,
            0.03283325955271721,
            0.03226703032851219,
            0.033171821385622025,
            0.030526990070939064,
            0.03082023561000824,
            0.027733400464057922,
            0.029554106295108795,
            0.026704611256718636,
            0.026182416826486588,
            0.02864256128668785,
            0.025897912681102753,
            0.024740371853113174,
            0.02608793042600155,
            0.026615070179104805,
            0.023240208625793457,
            0.024694424122571945
         ],
         "accuracy": [
            0.22148765623569489,
            0.6123170256614685,
            0.7557979226112366,
            0.8270168900489807,
            0.8673548698425293,
            0.8949480056762695,
            0.9153114557266235,
            0.9281092882156372,
            0.9379552006721497,
            0.9468288421630859,
            0.9544650912284851,
            0.9585484266281128,
            0.9644700288772583,
            0.9681997895240784,
            0.9707629084587097,
            0.9746870994567871,
            0.9744926691055298,
            0.978187084197998,
            0.9793007373809814,
            0.9808739423751831,
            0.9816517233848572,
            0.9819875359535217,
            0.9837198853492737,
            0.9837905764579773,
            0.9867956042289734,
            0.9844622611999512,
            0.9871314167976379,
            0.9860885143280029,
            0.9880682826042175,
            0.9872198104858398,
            0.9885985851287842,
            0.9884748458862305,
            0.9897298812866211,
            0.9900304079055786,
            0.9901010990142822,
            0.9901010990142822,
            0.9900304079055786,
            0.9904723167419434,
            0.990861177444458,
            0.9919217824935913,
            0.9911440014839172,
            0.9916743040084839,
            0.9925227761268616,
            0.992045521736145,
            0.992363691329956,
            0.9928233027458191,
            0.9921339154243469,
            0.9924344420433044,
            0.9931238293647766,
            0.992770254611969
         ],
         "val_loss": [
            1.413421392440796,
            0.740161120891571,
            0.4718972146511078,
            0.3675007224082947,
            0.2936418950557709,
            0.22842809557914734,
            0.20712660253047943,
            0.21511602401733398,
            0.17857633531093597,
            0.15069104731082916,
            0.13205966353416443,
            0.10943397879600525,
            0.11699581146240234,
            0.11983560025691986,
            0.1344829499721527,
            0.10791300982236862,
            0.10598154366016388,
            0.11233697831630707,
            0.15902400016784668,
            0.09911494702100754,
            0.10885421931743622,
            0.1298380196094513,
            0.09054311364889145,
            0.09373340755701065,
            0.10217366367578506,
            0.09630177170038223,
            0.09012319892644882,
            0.09877786040306091,
            0.07842684537172318,
            0.09509147703647614,
            0.10187932103872299,
            0.12011384218931198,
            0.1021537259221077,
            0.08680640906095505,
            0.09570589661598206,
            0.11836382746696472,
            0.10836206376552582,
            0.10025805234909058,
            0.08730295300483704,
            0.11602932214736938,
            0.12141401320695877,
            0.08752717077732086,
            0.10758659988641739,
            0.08834710717201233,
            0.10383301973342896,
            0.09809961915016174,
            0.11692684143781662,
            0.09609906375408173,
            0.10167764127254486,
            0.10739649087190628
         ],
         "val_accuracy": [
            0.5684611797332764,
            0.7641133666038513,
            0.8465172052383423,
            0.8786706328392029,
            0.9029706120491028,
            0.9278397560119629,
            0.9321079254150391,
            0.9293763041496277,
            0.9445708990097046,
            0.9529933929443359,
            0.9591964483261108,
            0.9676189422607422,
            0.9644320607185364,
            0.9648873209953308,
            0.961586594581604,
            0.9700090885162354,
            0.9692692756652832,
            0.9668222069740295,
            0.9590257406234741,
            0.9739357829093933,
            0.9692124128341675,
            0.9643751382827759,
            0.9736512899398804,
            0.9755292534828186,
            0.9717163443565369,
            0.9751877784729004,
            0.9771227240562439,
            0.9725130796432495,
            0.9796835780143738,
            0.9758707284927368,
            0.974732518196106,
            0.9683587551116943,
            0.9753016233444214,
            0.977862536907196,
            0.9762121438980103,
            0.9739927053451538,
            0.9736512899398804,
            0.9759275913238525,
            0.976098358631134,
            0.9749032258987427,
            0.972456157207489,
            0.9784885048866272,
            0.9750739932060242,
            0.9784315824508667,
            0.9771795868873596,
            0.9793990254402161,
            0.9752447009086609,
            0.9789437651634216,
            0.9767243266105652,
            0.9747894406318665
         ]
      }
   }
}